---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DetailEllipse
source: html/8433dbd0-23a9-9ab5-4bcf-6c8eaca3d471.htm
---
# DetailEllipse Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.